app/controllers/api/v1/auth/pro/register_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'Ohfaiofho' LIMIT 1
INSERT INTO `users` (`name`, `username`, `email`, `password_digest`, `token`, `role`) VALUES ('Aliheafoh', 'Éditons j’ai', 'Ohfaiofho', '$2a$12$rjlcCPA8gMW914sePBDr2.hwHr97kUXnLpTMwf2oY/IoSsZh0TU1a', 'a2ec97659fdfc6f5a1085563e5b4708bfe9c71a9', 'pro')
---
  def create
    @user = User.new(user_params)
    @user.role = 'pro'
    if User.find_by_email(@user.email)
      render json:{ error: "L'email existe déja"}, status: :conflict
    end

    if @user.save