app/controllers/api/v1/auth/pro/registers_controller.rb

SELECT `users_pros`.* FROM `users_pros` WHERE `users_pros`.`email` = 'enio@gmail.com' LIMIT 1
INSERT INTO `users` (`name`, `username`, `email`, `password_digest`, `token`, `role`) VALUES ('Aiello', 'Enio', 'eniefzpoefko@gmail.com', '$2a$12$XraPCYX/ZYT2ArPW/WHXA.NwVYfHBt8Cfc2/LlIFxdfVkD.oC.buu', '41ba166aa7caa811b1f5dfee4644d86be06d7bc8', 'pro')
INSERT INTO `users_pros` (`name`, `username`, `email`, `password_digest`, `token`) VALUES ('Aiello', 'Enio', 'enio@gmail.com', '$2a$12$qGPVmmQ26wB86d4jxyBk4.6jIZkS/4s28uwsx2tR6wmrXnV9I5Fla', '9d582d10c90ca01a16b4ed622223ddf73b94322e')
---
  def create
    @user = UsersPros.new(user_params)
    if UsersPros.find_by_email(@user.email)
      render json:{ error: "L'email existe déja"}, status: :conflict
    end

    if @user.save