app/controllers/api/v1/auth/pro/registers_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'eniefzpoefko@gmail.com' LIMIT 1
---
  def create
    @user = User.new(user_params)
    @user.role = 'pro'
    if User.find_by_email(@user.email)