app/controllers/api/v1/auth/pro/sessions_controller.rb

  def create
    user = UsersPro.find_by(email: auth_params[:email])
---
SELECT `users_pros`.* FROM `users_pros` WHERE `users_pros`.`email` = 'enio@gmail.com' LIMIT 1