app/controllers/api/v1/auth/client/register_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'enio@gmail.com' LIMIT 1
INSERT INTO `users` (`name`, `username`, `email`, `password_digest`, `token`, `role`) VALUES ('Bevilacqua', 'Matis', 'matis@gmail.com', '$2a$12$ObMCU8cFfIpFz7.8Nr5g..dOSELUDnfEvzZFd4Wz78mixTOoRYykm', '8e1fa75cc5bbb321ef380fb482e2dabd55434b4c', 'client')
---
  def create
    @user = User.new(user_params)
    @user.role = 'client'
    if User.find_by_email(@user.email)
      render json:{ error: "L'email existe déja"}, status: :conflict
    end

    if @user.save