app/controllers/api/v1/auth/client/registers_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'enio@gmail.com' LIMIT 1
INSERT INTO `users` (`name`, `username`, `email`, `password_digest`, `token`, `role`) VALUES ('Aiello', 'Enio', 'eniosdefzefz@gmail.com', '$2a$12$iZtdlEtb93sJXmqKEl8al.08j/2EcwWPeXkf2Vpyv6ZzpzM/J16IS', '33e9e1a39f861cd6bcc9375dde8a67ecd58d5e89', 'client')
---
  def create
    @user = User.new(user_params)
    @user.role = 'client'
    if User.find_by_email(@user.email)
      render json:{ error: "L'email existe déja"}, status: :conflict
    end

    if @user.save