app/controllers/api/v1/auth/client/sessions_controller.rb

  def create
    user = User.find_by(email: auth_params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'enio@gmail.com' LIMIT 1