app/controllers/api/v1/auth/registers_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'enio@gmail.com' LIMIT 1
---
  def create
    @user = User.new(user_params)
    if User.find_by_email(@user.email)