app/controllers/api/v1/auth/session_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'enio@gmail.com' LIMIT 1
---
  def create
    user = User.find_by(email: auth_params[:email])