app/controllers/api/v1/test/tests_controller.rb

  def authenticate_user
    token = request.headers["Authorization"].split(" ").last
    @current_user = User.find_by(token: token)
    if @current_user.nil?
      @current_user = UsersPros.find_by(token: token)
---
SELECT `users`.* FROM `users` WHERE `users`.`token` = '9d582d10c90ca01a16b4ed622223ddf73b94322e' LIMIT 1
SELECT `users_pros`.* FROM `users_pros` WHERE `users_pros`.`token` = '9d582d10c90ca01a16b4ed622223ddf73b94322e' LIMIT 1