app/controllers/api/v1/user/pro/comments_controller.rb

  def create
    comment = Comment.new(comment_params)
    if comment.save
---
INSERT INTO `comments` (`content`, `send`, `profile_id`) VALUES ('This is a test comment.', 'Enio', 3)

  def authenticate_user
    token = request.headers["Authorization"].split(" ").last
    @current_user = User.find_by(token: token)
    if @current_user.nil?
      @current_user = UsersPros.find_by(token: token)
---
SELECT `users`.* FROM `users` WHERE `users`.`token` = '72a609aa4d95e7971785813eed6c185a2387eee8' LIMIT 1
SELECT `users_pros`.* FROM `users_pros` WHERE `users_pros`.`token` = '72a609aa4d95e7971785813eed6c185a2387eee' LIMIT 1