app/controllers/api/v1/user/pro/users_controller.rb

SELECT `users_pros`.* FROM `users_pros` WHERE `users_pros`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`profile_id` = 9 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`profile_id` = 9
---
    def show
        user = UsersPros.find(params[:id])
        comments = Comment.where(profile_id: user.id)
        comments.each do |comment|