app/controllers/api/v1/usr/users_controller.rb

  def show
    @user = UsersPros.find(params[:id])
---
SELECT `users_pros`.* FROM `users_pros` WHERE `users_pros`.`id` = 1 LIMIT 1