app/controllers/api/v1/user/chats_controller.rb

  def create
    chat = Chat.new(chat_params)
    if chat.save
---
INSERT INTO `chats` (`token_send`, `id_receive`, `message`) VALUES ('72a609aa4d95e7971785813eed6c185a2387eee8', NULL, 'This is a test comment.')

  def index
    user = @current_user
    id_send_arr = []
    send = Chat.where(id_send: user.id)
    send.each do |chat|
---
SELECT `chats`.* FROM `chats` WHERE `chats`.`id_send` = '10'

  def authenticate_user
    token = request.headers["Authorization"].split(" ").last
    @current_user = User.find_by_token(token)
---
SELECT `users`.* FROM `users` WHERE `users`.`token` = '72a609aa4d95e7971785813eed6c185a2387eee8' LIMIT 1