app/controllers/api/v1/user/chat_controller.rb

  def create
    chat = Chat.new(chat_params)
    if chat.save
---
INSERT INTO `chats` (`id_send`, `id_receive`, `message`) VALUES ('10', '1', 'Matis est très [ gentil ].')

  def authenticate_user
    token = request.headers["Authorization"].split(" ").last
    @current_user = User.find_by_token(token)
---
SELECT `users`.* FROM `users` WHERE `users`.`token` = '72a609aa4d95e7971785813eed6c185a2387eee8' LIMIT 1