app/controllers/api/v1/user/comment_controller.rb

  def create
    comment = Comment.new(comment_params)
    if comment.save
      user = User.find(params[:id])
      user.total_ranking ||= 0
      user.comment_count ||= 0
      user.average_ranking ||= 0
      user.total_ranking += comment.ranking
      user.comment_count += 1
      user.update_average_ranking
---
INSERT INTO `comments` (`content`, `send`, `profile_id`, `ranking`, `profile_name`) VALUES ('This is a test comment.', '10', 9, 1, NULL)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
UPDATE `users` SET `users`.`average_ranking` = 1.0, `users`.`comment_count` = 1, `users`.`total_ranking` = 1.0 WHERE `users`.`id` = 9

  def authenticate_user
    token = request.headers["Authorization"].split(" ").last
    @current_user = User.find_by(token: token)
---
SELECT `users`.* FROM `users` WHERE `users`.`token` = '72a609aa4d95e7971785813eed6c185a2387eee8' LIMIT 1