app/controllers/api/v1/user/comments_controller.rb

INSERT INTO `comments` (`content`, `send`, `profile_id`) VALUES ('This is a test comment.', '10', 1)
---
  def create
    comment = Comment.new(comment_params)
    if comment.save

SELECT `users`.* FROM `users` WHERE `users`.`token` = '72a609aa4d95e7971785813eed6c185a2387eee8' LIMIT 1
---
  def authenticate_user
    token = request.headers["Authorization"].split(" ").last
    @current_user = User.find_by(token: token)