app/controllers/api/v1/user/ranking_controller.rb

SELECT `users`.* FROM `users` WHERE (average_ranking > '0' and role = 'pro')
---
  def index
    user = User.where("average_ranking > ? and role = ?", 0, "pro")
    user_id = user.map(&:id)

SELECT `users`.* FROM `users` WHERE `users`.`id` IN (13, 19, 23, 25, 26, 27, 28, 30, 31)
---
  def show
    city = User.find(params[:city])