app/controllers/api/v1/user/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`profile_id` = 1
---
  def show
      user = User.find(params[:id])
      comments = Comment.where(profile_id: user.id)

SELECT `users`.* FROM `users` WHERE `users`.`role` = 'pro'
---
  def index
      user = User.where(role: "pro")