app/controllers/api/v1/user/user_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`profile_id` = 10
---
  def show
    user = User.find(params[:id])
    comments = Comment.where(profile_id: user.id)
    comments.each do |comment|