app/controllers/api/v1/cmts/stars_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`token` = '72a609aa4d95e7971785813eed6c185a2387eee8' LIMIT 1
INSERT INTO `comments` (`content`, `token`) VALUES ('ezflkoezpjk', '72a609aa4d95e7971785813eed6c185a2387eee8')
---
  def create
    @user = User.find_by(token: request.headers["Authorization"].split(" ").last)
    comment = Comment.new(comment_params)
    if comment.save