app/controllers/logins_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'johndoe@example.com' LIMIT 1
---
  def create
    user = User.find_by(email: auth_params[:email])