app/controllers/registers_controller.rb

  def create
    @user = User.new(user_params)
    if User.find_by_email(@user.email)
      render json:{ error: "L'email existe déja"}, status: :conflict
    end

    if @user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'johndoe@example.com' LIMIT 1
INSERT INTO `users` (`name`, `username`, `email`, `password_digest`, `token`) VALUES ('matis5', 'matis5', 'matis5@gmail.com', '$2a$12$3BnQwyU9sfd4lbOUtrUtjOkML2Zfz8wwher5A2hABltIk4x.qfGwa', '5a53fd9edee684f408572dbdaf1faa9f6562a2d1')