app/models/user.rb

  def update_average_ranking
    self.average_ranking = self.total_ranking / self.comment_count
    self.save
---
UPDATE `users` SET `users`.`average_ranking` = 3.6666666666666665, `users`.`comment_count` = 3, `users`.`total_ranking` = 11.0 WHERE `users`.`id` = 13