app/controllers/api/v1/profil/comments_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`content`, `token`, `profile_id`) VALUES ('This is a test comment.', '72a609aa4d95e7971785813eed6c185a2387eee8', NULL)
---
  def create
    @user = User.find(params[:id])
    @comment = @user.comments.new(comment_params)
    if @comment.save